#+TITLE: October 29, 2019 - November 11, 2019 (14 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 14
  :SPRINTSTART: <2019-10-29 Tue>
  :wpd-akshay196: 1
  :wpd-bhavin192: 1
  :wpd-gandalfdwite: 1
  :END:
** akshay196
*** DONE Mastering Python Design Patterns - Part II [14/14]
    CLOSED: [2019-11-11 Mon 21:39]
    :PROPERTIES:
    :ESTIMATED:  14
    :ACTUAL:   10.85
    :OWNER: akshay196
    :ID: READ.1569864940
    :TASKID: READ.1569864940
    :END:
    :LOGBOOK:
    CLOCK: [2019-11-11 Mon 20:52]--[2019-11-11 Mon 21:39] =>  0:47
    CLOCK: [2019-11-11 Mon 08:01]--[2019-11-11 Mon 08:39] =>  0:38
    CLOCK: [2019-11-10 Sun 14:03]--[2019-11-10 Sun 14:52] =>  0:49
    CLOCK: [2019-11-10 Sun 09:23]--[2019-11-10 Sun 10:20] =>  0:57
    CLOCK: [2019-11-09 Sat 21:08]--[2019-11-09 Sat 21:50] =>  0:42
    CLOCK: [2019-11-09 Sat 12:40]--[2019-11-09 Sat 13:28] =>  0:48
    CLOCK: [2019-11-08 Fri 23:30]--[2019-11-09 Sat 00:45] =>  1:15
    CLOCK: [2019-11-08 Fri 09:58]--[2019-11-08 Fri 10:46] =>  0:48
    CLOCK: [2019-11-07 Thu 19:58]--[2019-11-07 Thu 20:05] =>  0:07
    CLOCK: [2019-11-06 Wed 21:42]--[2019-11-06 Wed 22:33] =>  0:51
    CLOCK: [2019-11-06 Wed 07:28]--[2019-11-06 Wed 08:04] =>  0:36
    CLOCK: [2019-11-04 Mon 22:44]--[2019-11-04 Mon 23:17] =>  0:33
    CLOCK: [2019-11-04 Mon 08:10]--[2019-11-04 Mon 08:34] =>  0:24
    CLOCK: [2019-11-01 Fri 23:36]--[2019-11-02 Sat 00:00] =>  0:24
    CLOCK: [2019-10-31 Thu 23:35]--[2019-11-01 Fri 00:47] =>  1:12
    :END:
    Second Edition. by Sakis Kasampalis, Kamon Ayeva.
    https://learning.oreilly.com/library/view/mastering-python-design/9781788837484/
    - [X] The Command Pattern                              (1h)
    - [X] The Observer Pattern                             (1h)
    - [X] The State Pattern                                (1h)
    - [X] Interpreter pattern                              (1h)
    - [X] Strategy pattern                                 (1h)
    - [X] Memento pattern                                  (1h)
    - [X] Iterator pattern                                 (1h)
    - [X] Template pattern                                 (1h)
    - [X] The Observer Pattern in Reactive Programming     (1h)
    - [X] The Microservices pattern                        (1h)
    - [X] The Retry pattern                                (1h)
    - [X] The Circuit Breaker pattern                      (1h)
    - [X] The Cache-Aside pattern                          (1h)
    - [X] Throttling                                       (1h)
** bhavin192
*** DONE Work on [[https://github.com/jaegertracing/jaeger-operator/issues/487][jaegertracing/jaeger-operator/#487]]
    CLOSED: [2019-11-11 Mon 22:56]
    :PROPERTIES:
    :ESTIMATED: 8
    :ACTUAL:   7.03
    :OWNER:    bhavin192
    :ID:       OPS.1572333551
    :TASKID:   OPS.1572333551
    :END:
    :LOGBOOK:
    CLOCK: [2019-11-11 Mon 22:11]--[2019-11-11 Mon 22:56] =>  0:45
    CLOCK: [2019-11-08 Fri 22:56]--[2019-11-08 Fri 23:01] =>  0:05
    CLOCK: [2019-11-08 Fri 19:16]--[2019-11-08 Fri 20:21] =>  1:05
    CLOCK: [2019-11-07 Thu 15:05]--[2019-11-07 Thu 15:23] =>  0:18
    CLOCK: [2019-11-06 Wed 21:24]--[2019-11-06 Wed 21:33] =>  0:09
    CLOCK: [2019-11-06 Wed 19:26]--[2019-11-06 Wed 19:40] =>  0:14
    CLOCK: [2019-11-06 Wed 11:14]--[2019-11-06 Wed 11:58] =>  0:44
    CLOCK: [2019-11-05 Tue 21:34]--[2019-11-05 Tue 22:03] =>  0:29
    CLOCK: [2019-11-05 Tue 20:12]--[2019-11-05 Tue 20:19] =>  0:07
    CLOCK: [2019-11-04 Mon 19:24]--[2019-11-04 Mon 19:37] =>  0:13
    CLOCK: [2019-11-01 Fri 23:40]--[2019-11-02 Sat 00:12] =>  0:32
    CLOCK: [2019-11-01 Fri 20:19]--[2019-11-01 Fri 20:56] =>  0:37
    CLOCK: [2019-10-31 Thu 19:24]--[2019-10-31 Thu 19:50] =>  0:26
    CLOCK: [2019-10-30 Wed 19:31]--[2019-10-30 Wed 20:09] =>  0:38
    CLOCK: [2019-10-30 Wed 19:06]--[2019-10-30 Wed 19:18] =>  0:12
    CLOCK: [2019-10-29 Tue 21:08]--[2019-10-29 Tue 21:26] =>  0:18
    CLOCK: [2019-10-29 Tue 13:45]--[2019-10-29 Tue 13:55] =>  0:10
    :END:
*** DONE Attend EmacsConf 2019
    CLOSED: [2019-11-03 Sun 03:10]
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:   7.90
    :OWNER:    bhavin192
    :ID:       EVENT.1572333631
    :TASKID:   EVENT.1572333631
    :END:
    :LOGBOOK:
    CLOCK: [2019-11-03 Sun 00:23]--[2019-11-03 Sun 03:10] =>  2:47
    CLOCK: [2019-11-02 Sat 18:25]--[2019-11-02 Sat 23:32] =>  5:07
    :END:
    https://emacsconf.org/2019/schedule
** gandalfdwite
*** DONE Cloud Native DevOps - Part - III [4/4]
    CLOSED: [2019-11-10 Sun 22:23]
    :PROPERTIES:
    :ESTIMATED: 9
    :ACTUAL:   9.95
    :OWNER:    gandalfdwite
    :ID:       READ.1568308423
    :TASKID:   READ.1568308423
    :END:
    :LOGBOOK:
    CLOCK: [2019-11-10 Sun 20:22]--[2019-11-10 Sun 21:10] =>  0:48
    CLOCK: [2019-11-09 Sat 13:25]--[2019-11-09 Sat 15:21] =>  1:56
    CLOCK: [2019-11-05 Tue 20:23]--[2019-11-05 Tue 21:25] =>  1:02
    CLOCK: [2019-11-06 Wed 22:55]--[2019-11-06 Wed 23:40] =>  0:45
    CLOCK: [2019-11-05 Tue 20:23]--[2019-11-05 Tue 21:25] =>  1:02
    CLOCK: [2019-11-04 Mon 23:35]--[2019-11-05 Tue 00:25] =>  0:50
    CLOCK: [2019-11-03 Sun 13:05]--[2019-11-03 Sun 14:27] =>  1:22
    CLOCK: [2019-11-01 Fri 22:10]--[2019-11-01 Fri 23:27] =>  1:17
    CLOCK: [2019-10-29 Tue 19:20]--[2019-10-29 Tue 20:15] =>  0:55
    :END:

     - [X] 13. Development Workflow             ( 2h )
     - [X] 14. CD in Kubernetes                 ( 2h )
     - [X] 15. Observability and Monitoring     ( 2h )
     - [X] 16. Merics in Kubernetes             ( 3h )
*** DONE EmacsConf 2019 [1/1]
    CLOSED: [2019-11-03 Sun 11:49]
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:   4.08
    :OWNER:    gandalfdwite
    :ID:       EVENT.1572287595
    :TASKID:   EVENT.1572287595
    :END:
    CLOCK: [2019-11-02 Sat 21:10]--[2019-11-02 Sat 23:10] =>  2:00
    CLOCK: [2019-11-02 Sat 18:25]--[2019-11-02 Sat 20:30] =>  2:05
     - [X] Attend EmacsConf on 2nd November 2019 (online)   ( 5h )
